students = [
    {
        '이름' : '김싸피',
        '국어' : 80,
        '영어' : 95,
        '수학' : 85
    },
    {
        '이름' : '이싸피',
        '국어' : 95,
        '영어' : 95,
        '수학' : 70
    },
    {
        '이름' : '박싸피',
        '국어' : 100,
        '영어' : 80,
        '수학' : 60
    },
    {
        '이름' : '최싸피',
        '국어' : 75,
        '영어' : 100,
        '수학' : 55
    },

]

# 모든 학생들의 평균 점수를 이름 :  점수 형태로 출력하세요
# 각 과목별 퐁점을 '과목명 : 점수' 형태로 출력하세요
# 각 과목별 최고점을 받은 학생의 이름을 '과목 : 이름' 형태로 출력하세요
# 각 과목별 평균 점수를 '과목명 : 점수' 형태로 출력하세요